app/controllers/careers_controller.rb

  def show
    @career = Career.find(params[:id])
---
SELECT "careers".* FROM "careers" WHERE "careers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @career = Career.new(params[:career])

    respond_to do |format|
      if @career.save
---
INSERT INTO "careers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 12 Jun 2013 19:11:15 UTC +00:00], ["name", "Programacion IV"], ["updated_at", Wed, 12 Jun 2013 19:11:15 UTC +00:00]]