app/controllers/user_careers_controller.rb

SELECT "user_careers".* FROM "user_careers"
---
  def index
    @user_careers = UserCareer.all

SELECT "user_careers".* FROM "user_careers" WHERE "user_careers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @user_career = UserCareer.find(params[:id])

INSERT INTO "user_careers" ("career_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["career_id", 1], ["created_at", Wed, 12 Jun 2013 19:11:48 UTC +00:00], ["updated_at", Wed, 12 Jun 2013 19:11:48 UTC +00:00], ["user_id", 1]]
---
  def create
    @user_career = UserCareer.new(params[:user_career])

    respond_to do |format|
      if @user_career.save