app/controllers/users_controller.rb

INSERT INTO "users" ("alias", "created_at", "email", "lastname", "name", "pass", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
     @user = User.new(params[:user])

     respond_to do |format|
     if @user.save